[
    {
        "review_text": "I recently completed the \"Build a Portfolio Website with HTML, CSS, and JavaScript\" project on Coursera, and it was a fantastic experience! This course provided a thorough introduction to front-end development, helping me build a professional portfolio website from the ground up.\n\nPros:\n\nHands-on Learning: Practical exercises that reinforced theoretical concepts.\nComprehensive Content: Detailed modules covering HTML, CSS, and JavaScript.\nClear Instructions: Easy-to-follow guidelines that made complex topics accessible.\nProfessional Outcome: End result was a fully functional, responsive website.\nCons:\n\nPace: Some sections felt a bit rushed for beginners.\nSupport: Limited direct support; relied heavily on peer forums.\nOverall, I highly recommend this course to anyone looking to enhance their web development skills. It’s a great way to build a tangible project for your portfolio!",
        "name": "By IBRAR A",
        "date": "Jun 15, 2024",
        "stars": 5
    },
    {
        "review_text": "A huge thanks for the \"Build a Portfolio Website with HTML, CSS, and JavaScript\" course! It's been an amazing experience diving into the practical aspects of web development. The hands-on learning and clear instructions made it both enjoyable and educational. Looking forward to implementing these skills. Kudos on providing such a fantastic learning journey!",
        "name": "By Abdel-rahman M A",
        "date": "Jan 6, 2024",
        "stars": 5
    },
    {
        "review_text": "This project gives me the platform to add my work on my profile which is great. The fact that I can showcase more details about me with the site link and GitHub makes it awesome.",
        "name": "By Saidat",
        "date": "Jan 19, 2024",
        "stars": 5
    },
    {
        "review_text": "i have learned a lot of new things  ideas from this point.",
        "name": "By Kratika v",
        "date": "Aug 9, 2023",
        "stars": 5
    },
    {
        "review_text": "please do the work constantly",
        "name": "By Jamil U",
        "date": "Jun 3, 2024",
        "stars": 5
    },
    {
        "review_text": "Please review my work.",
        "name": "By Asad U",
        "date": "Aug 12, 2024",
        "stars": 5
    },
    {
        "review_text": "great opportunity",
        "name": "By basit o",
        "date": "Oct 28, 2023",
        "stars": 5
    },
    {
        "review_text": "great learning",
        "name": "By Moaish P",
        "date": "Feb 16, 2024",
        "stars": 5
    },
    {
        "review_text": "Very usefull",
        "name": "By Harshana M",
        "date": "Mar 11, 2025",
        "stars": 5
    },
    {
        "review_text": "Very goood!",
        "name": "By Deleted A",
        "date": "Dec 31, 2024",
        "stars": 5
    }
]