[
    {
        "review_text": "Best Course So Far! Everything is well explained and covered in detail with demo videos. Totally Worth It.",
        "name": "By Muhammad T F",
        "date": "Sep 19, 2024",
        "stars": 5
    },
    {
        "review_text": "Right amount of information for a comprehensive overview of the fundamentals.",
        "name": "By Sakimi F",
        "date": "Sep 19, 2024",
        "stars": 5
    },
    {
        "review_text": "I'm very glad to be here.. concepts are explained clearly...",
        "name": "By MAHESH C",
        "date": "Aug 16, 2024",
        "stars": 4
    },
    {
        "review_text": "Cheesy AI voice mispronounced half of the important terminology.  Lots of spelling and grammatical errors, and some grading errors.  Overall, just real basic information, but a good foundation.",
        "name": "By Christopher P",
        "date": "Aug 31, 2024",
        "stars": 3
    },
    {
        "review_text": "Overall, the structure of the course contains useful information that is lacking in practically in usage.",
        "name": "By Kanatbek A",
        "date": "Aug 14, 2024",
        "stars": 3
    },
    {
        "review_text": "Just completed the Ethical Hacking Fundamentals course by Coursera as part of the HEC DLSEI3.0 Y1-C Program, and I must say, it has been an incredibly enriching experience! 💻🔐\n\nThe course offered a solid foundation in ethical hacking techniques, including penetration testing, network security, and vulnerability assessment. The instructors were highly knowledgeable and provided practical, hands-on knowledge that can be applied in real-world scenarios.\n\nWhat I really appreciated was the well-structured content, interactive quizzes, and the opportunity to work on real-world challenges. It truly broadened my understanding of cybersecurity and ethical hacking practices.\n\nI highly recommend this course to anyone interested in diving deep into ethical hacking and cybersecurity, as it not only enhances your skills but also builds a strong ethical foundation for protecting digital assets. 🛡️\n\n#EthicalHacking #Coursera #CyberSecurity #HECDLSEI3.0 #LearningJourney #CyberAwareness",
        "name": "By AbuBaker A",
        "date": "Feb 10, 2025",
        "stars": 5
    },
    {
        "review_text": "I am a retired 63-year-old   needing to go back to work, I found this course give me hope! That i have not felt for so many years. thank you for such a wonderful oppertunity! This course was amazing! I look forward to taking many more courses to fulfill my needs.",
        "name": "By Lucita F",
        "date": "Mar 28, 2025",
        "stars": 5
    },
    {
        "review_text": "Would like a more in-depth elaboration of some hacking fundamentals like - enumeration and pen testing, overall a great course for people who want to learn ethical hacking",
        "name": "By Peddinti V R",
        "date": "Jan 18, 2025",
        "stars": 5
    },
    {
        "review_text": "This was a great fundamental course to prepare me for the exam.",
        "name": "By Chris T",
        "date": "May 22, 2025",
        "stars": 5
    },
    {
        "review_text": "Best Course but I can't Got mine Professional Certificate 😉",
        "name": "By iTz N",
        "date": "Jun 1, 2025",
        "stars": 5
    }
]