[
    {
        "review_text": "Labs not included",
        "name": "By Latchman S",
        "date": "Jan 2, 2023",
        "stars": 1
    },
    {
        "review_text": "the course talked about labs a lot but none exist.",
        "name": "By Rob P",
        "date": "Oct 28, 2022",
        "stars": 4
    },
    {
        "review_text": "this course is filled with theories and no practical to help the learners acquire skills for the real job or task, which I find un-encouraging.",
        "name": "By Marylene M",
        "date": "May 26, 2023",
        "stars": 1
    },
    {
        "review_text": "50$ for something i can watch on youtube? hell nah mate, sorry.\nno practical knowledge they give. they lure you by saying \"you'll do these with hands on labs\" and what's the surprise? THERE'S NO LAB!! YOU BUY THEM FOR???? 200$$$\nlmfao. this is hella misleading.",
        "name": "By Tavish S N",
        "date": "Aug 20, 2023",
        "stars": 1
    },
    {
        "review_text": "What everyone is saying about the labs is correct, go to the EC Council website to get this course, not here.",
        "name": "By Michael",
        "date": "Apr 7, 2023",
        "stars": 1
    },
    {
        "review_text": "This course has no labs even though is advertised as labs are included. Tutor also mentions labs all the time and when you check questions from people in the forum, everyone is asking about it but they don't even bother to reply to people.  Spare yourself time and find a proper course with proper labs.",
        "name": "By Evelina K",
        "date": "Apr 5, 2024",
        "stars": 1
    },
    {
        "review_text": "Thank you soo much for this wonderful course. Best part about this course are the following\nInstructor 10/10 ,  Study material 10/10 its just a perfect course",
        "name": "By Prince",
        "date": "Jan 10, 2023",
        "stars": 5
    },
    {
        "review_text": "Essentials for everything ( hacking ).\ngood course with detailed content.\n I recommend it to everyone who wants to know the essentials of hacking.",
        "name": "By Mani",
        "date": "Apr 1, 2023",
        "stars": 5
    },
    {
        "review_text": "This course is well designed and wants more practical lectures.",
        "name": "By Purushothaman B",
        "date": "Jan 3, 2023",
        "stars": 4
    },
    {
        "review_text": "I was expecting some LABS to practice but the course it is just a bunch of videos. This will not give you any kind of practice. I highly recommend the CyberSecurity from Google which it has some labs and teaches you how to use LINUX, PYTHON, WIRESHARK and more. I don't think this is helpful to start your IT career.",
        "name": "By Lucas N",
        "date": "Feb 28, 2024",
        "stars": 2
    }
]