[
    {
        "review_text": "this course is so reasonable in price and with good assignments! At first, im annoyed if i got only 70 or below, ii will need to redo. but it does help me to consolidate my knowledge. so thank you!!",
        "name": "By Chan C K",
        "date": "Mar 5, 2020",
        "stars": 5
    },
    {
        "review_text": "The primary reason for enrolling in the course was to enhance my knowledge base of human physiology. Although it has been many decades since I've taken anatomy and physiology as well as pathophysiology, I have taught it twice at the secondary level.  Upon reviewing the description of the course, it indicated that it was introductory, but knowledge of biology/science would be helpful, I thought it might be a great refresher course.  I beg to differ! This course WAS NOT introductory.  Let me give you the positives first: pdf's and readings were extremely helpful.  The negatives, the instructors were not impressive. One instructor talked absolutely too fast and much too often wouldn't complete the sentences OR she would repeat words or phrases that didn't make sense. I found it difficult to grasp the lecture when this instructor couldn't get through a sentence without stumbling over her thoughts, mumbling, trailing off and not finishing her sentence, etc. More often than not, the information provided in the lecture was inconsistent with the notes/pdf's. One other thing, she constantly smacked her mouth which was nerve-wrecking!  During the lectures, she would write on the powerpoints, which was either sloppy or not legible. After the fifth week, I honestly wanted to withdraw from the course, but decided to finish it out solely because it was half way completed and the time that had already been invested.  Many viewers gave the course 5 stars, I could not.  Although I completed the course with a 93.4% grade, the level of information was extensive, to some degree over the top.  The course needs to be restructured so that it stays within the context of an introductory course.  In my opinion, this course is more suitable for a first-second year medical student.  BTW, this is the sixth course that I have completed through Coursera, including a specialization.  Good luck!",
        "name": "By Maxine P M",
        "date": "Jun 28, 2020",
        "stars": 2
    },
    {
        "review_text": "I'm a high school student interested in human physiology. \nThis course is AMAZING! Though sometimes I felt overwhelmed and couldn't remember everything, I think it was worth every effort and energy.",
        "name": "By Lucy L",
        "date": "Jun 2, 2016",
        "stars": 5
    },
    {
        "review_text": "Best course I've ever taken!  Detailed and thorough explanations of the systems of the body.  Fascinating, enlightening, and enjoyable.  Highly recommend for anyone interested in how the body functions.",
        "name": "By Jade D",
        "date": "Jan 4, 2021",
        "stars": 5
    },
    {
        "review_text": "Very informative, straight forward, and was practically free too! The teachers were very easy to understand, had a real passion for their subject, and I really learned a lot. Would totally recommend!",
        "name": "By Vinayak B",
        "date": "Sep 12, 2020",
        "stars": 5
    },
    {
        "review_text": "I am an incoming medical student here in the Philippines and this course has provided me with enough background about the human body and the underlying machinery of every system associated with it.",
        "name": "By Kin I R N",
        "date": "Apr 16, 2018",
        "stars": 5
    },
    {
        "review_text": "It is so hard to learn from a professor who can't get through 2  sentences without stumbling over her thoughts, mumbling, trailing off  and not finishing her sentence, etc. Perhaps if she spent less time  pretending to be John Madden with her little board, she could focus on  being an effective orator. Perhaps the second professor would have been better, but after 2 hours of listening to Dr. Jakoi, I now have to contact Coursera to see if I can get a refund or switch courses.",
        "name": "By Joshua S",
        "date": "Dec 9, 2019",
        "stars": 1
    },
    {
        "review_text": "Great class - very dense, like drinking from a fire hose, but wow I learned a lot! I took this just because I wanted to learn more about how the body magically does what it does, every day, without me thinking about it. I had no prior experience in physiology or anatomy, so this required me to do a LOT of note-taking and a little bit of Googling on the side for further understanding. If a week's videos totaled 2 hours, I spent about 4-5 getting through them and taking notes. I should add that I did not use the forums regularly, but I saw that many students had, and that their questions were answered fairly promptly, often by Emma Jakoi herself. The end-of-unit quizzes always included questions which forced you to apply your new learning to cases, and these could be challenging! Thanks to Duke for making this great class available online for free.",
        "name": "By Sylvia Q",
        "date": "Jan 18, 2020",
        "stars": 5
    },
    {
        "review_text": "I gained a deeper understanding and greater appreciation for how my body works.  Thank you to the Teams at Duke and Coursera for making such a wide body of information available to the motivated.",
        "name": "By Dave H",
        "date": "Oct 11, 2016",
        "stars": 5
    },
    {
        "review_text": "I'm a college freshman (majoring in nursing) and I took this course due to the pandemic. I found this course challenging since it focuses more on the physiology of the human body in more detail than a regular my anatomy and physiology class back in high school. This course isn't really an \"introductory\" course, you may need some background on science courses like chemistry, biology, anatomy, and physiology (So keep that in mind if you want to enroll). I have a limited background in science these courses (Biology, chemistry, etc) and finished this course, and yes it is possible to finish this course without knowing all about science stuff, it just took a little more effort to quickly learn science terms and stuff. With all of that, the course was great and for a nursing major like me really helped me developed surface-level knowledge about the function of the human body. Lectures are good, a little fast for me but they provide great PDF that I can refer to. Practice quizzes did help me a lot, but I hope that they provide feedback or explanation on why I got it wrong instead of just showing \"correct\" or \"incorrect\". It's worth my time learning physiology and I highly recommend it! Big thanks to the instructors and staff, especially Coursera for making this course free to the public!",
        "name": "By Dustin D S J",
        "date": "Aug 23, 2020",
        "stars": 5
    }
]