[
    {
        "review_text": "The course content : The course content is 3/5 I think there is more to be provided especially at 2020, more actual application than just explanation of major concepts. For example we haven't constructed a phylogeny tree using a computer program, maybe the course should try and approach online students with more Online practical tools. (I consider it abit outdated 3.5/5)\nThe course explanation : Prof. Noor is a wonderful instructor, he constructed the course beautifully and explained it the same, the existence of interactive slides and varied topics is wonderful (5/5)\nThe quiz and support : That's the terrible part of the course, the course is Dead, no instructor support or rarely you see any, I have asked multiple questions across various weeks and expected atleast an answer after a week, nothing so far. Instructor support is more than necessary to make the course outcome 100%, however I consider my outcomes about 70%. The quizes are sometimes phrased in unnecessarily difficult to comprehend structure, maybe revisit that. (1/5)\n\nThe external material : They are mostly over comprehensive and not focused just on what we have learnt instead they are a broader line up and deeper focus on the topic itself, meeting stuff we haven't actually learned and having no one to go back to and discuss it with makes the external sources utterly useless. (0/5)\n\nCourse access : Coursera has provided incredibly easy interface, wonderful customer support and financial aid to developing students like me, Having myself learnt 70% at a course from Duke university is INCREDIBLE, all thanks to the efforts of the professor and coursera team. Thank you.",
        "name": "By SiefElDin S",
        "date": "May 25, 2020",
        "stars": 3
    },
    {
        "review_text": "The course is really interesting! I love the way the professor demonstrate genetics theories by countless examples and evidence. And those questions about debates in genetics are thought-provoking!",
        "name": "By Yuqing H",
        "date": "Jul 4, 2017",
        "stars": 5
    },
    {
        "review_text": "Very good course that prepared me for Genetics at Pima Community College in Tucson. I am able to follow the lectures and actually understand what is being presented. I am glad I took this course.",
        "name": "By Theresa R N",
        "date": "Sep 29, 2017",
        "stars": 5
    },
    {
        "review_text": "The course is great for students who are particularly interested in genetics and evolution. As the weeks go by, the lectures get trickier and more professional, but we just have to stick with it. Prof. Noor is a great teacher and will give analogies and metaphors to help explain the concepts better. The weekly quizzes are quite challenging, with the questions changing after every try. Aim at encountering newer questions than just passing. However, I would have really liked solutions for the quiz answers somewhere, perhaps at the end of the course after the grade is locked in. \nOverall, I had so much fun learning and it has strengthened my will to make my career in it. Thank you, Prof. Noor and his staff!",
        "name": "By Shruti S",
        "date": "Jul 12, 2020",
        "stars": 5
    },
    {
        "review_text": "An amazing course that explains so many natural phenomena. Dr Noor is a passionate, interesting and fun lecturer and was able to fit so much interesting and helpful sections into this course.",
        "name": "By Ariel K",
        "date": "Mar 31, 2020",
        "stars": 5
    },
    {
        "review_text": "Thoroughly enjoying the course content. I am a Software Engineer and am doing this course out of personal interest. I was a bit hesitant if I would be able to sustain the interest through the length of the course. Dr. Mohamed Noor has done an amazing job in introducing and building on the concepts week after week. My sincere thanks to the Dr. Mohamed Noor and Duke University for offering this course online.",
        "name": "By Ramanuja-Chary A",
        "date": "Jul 6, 2018",
        "stars": 5
    },
    {
        "review_text": "Excellent course. Would recommend it to anyone who wants to delve in the subject matter. Wonderful instructor and interesting lecture videos. One of the best courses I have taken in Coursera.",
        "name": "By Iromi W",
        "date": "Jan 9, 2016",
        "stars": 5
    },
    {
        "review_text": "I really enjoyed the classes and the supplemental materials available. I loved how the lessons were taught and explained by Dr. Mohamed Noor and I really enjoyed the content of the classes.",
        "name": "By Vanessa L",
        "date": "Jan 18, 2017",
        "stars": 5
    },
    {
        "review_text": "Great introduction-- not a single lesson was lacking. Professor Noor is engaging, feels approachable (even behind a screen), and I found the class appropriately challenging. There were times I felt I completely grasped the \"important\" parts of lectures only to begin a quiz and realize that I didn't. The quizzes really helped me to see that I had to understand much more about how to apply the messages to other situations, or compound scenarios. Good lesson in logic. Computation also matters in this course, which can be tough for someone more used to reading pop-science analyses. I appreciated being held accountable and learned far more than I would if I'd just read a book.",
        "name": "By Corinna M",
        "date": "Oct 9, 2016",
        "stars": 5
    },
    {
        "review_text": "Really great course. Has a lot of interesting real life examples and covers all of the basics of genetics in comprehensive detail. Really glad I did the course and hope to use the knowledge gained in my future career.",
        "name": "By Patrick M",
        "date": "Aug 9, 2019",
        "stars": 5
    }
]