[
    {
        "review_text": "Informative but not very engaging. Videos were mainly slide after slide of text with the occasional graphic. Presenters sounded bored and read the slides almost verbatim, often going too fast. End-of-week quizzes were just compilations of the in-video quizzes. Also frequent errors and typos in quizzes.\n'Honors' liver cancer course was essentially identical to the liver cancer section in the main course.",
        "name": "By Dan",
        "date": "Dec 26, 2018",
        "stars": 3
    },
    {
        "review_text": "Thanks a lot, Dr. Kenneth; the course has been very informative and mind-opening--it has also whetted my appetite to learn more about the topic.\nThanks and best of regards in your endeavours!",
        "name": "By Simon S",
        "date": "Apr 12, 2019",
        "stars": 5
    },
    {
        "review_text": "great course with very experience lecturers . it has helped me to gain more insight into cancer development. thank you so much Dr. Kenneth J. Pienta and the other doctors. God bless you all.",
        "name": "By Ibrahim Y",
        "date": "Feb 26, 2017",
        "stars": 5
    },
    {
        "review_text": "I am an Undergraduate student and i didnt even read oncology subject, but this course not just start the beginer level , butt gradually it goes in depth and the flow of lectuures and topics is smooth",
        "name": "By Ayesha H",
        "date": "Mar 18, 2017",
        "stars": 5
    },
    {
        "review_text": "It was a course of much interest.  Everything is explained very simply.  I have learned lot of important information. I am delighted to be able to do this online course at  JOHNS HOPIKNS university.",
        "name": "By Fardin A A",
        "date": "Jun 6, 2020",
        "stars": 5
    },
    {
        "review_text": "It will be very helpful to me for doing my research work on the very same topic.\nBut all of these courses should be free of cost,just like this one.\nThanking you once again !\nRegards.",
        "name": "By Omer K",
        "date": "Nov 23, 2016",
        "stars": 5
    },
    {
        "review_text": "كانت دورة مفيدة لفهم السرطان",
        "name": "By Mohammad D A",
        "date": "Dec 18, 2018",
        "stars": 5
    },
    {
        "review_text": "A beautifully structured course with highly valuable information explained with great detail in a simplified manner. Highly recommended for anyone interested to gain overall understanding of Cancer.",
        "name": "By Shriya I",
        "date": "Jan 14, 2022",
        "stars": 5
    },
    {
        "review_text": "Excellent course for anyone interested in knowing more about the origin, diagnosis and treatment of cancer, even for beginners. Thanks to JHU for putting such an excellent course material together!",
        "name": "By Ankit K",
        "date": "Aug 1, 2020",
        "stars": 5
    },
    {
        "review_text": "I'm a high schooler who's always loved science, but I really felt a need to understand cancer after my grandma was diagnosed with stage 3c NSLC. This course gave me that understanding. \nFrom completing this course with honors, I've learned so much about cancer - from its history to cellular biology to current standard-of-care cancer drugs. The instructors explained complicated processes clearly and provided many diagrams and medical scans in their presentations (as a visual learner, this was really helpful). I would absolutely recommend it.\nThank you so much, Coursera!",
        "name": "By Madison A",
        "date": "Apr 27, 2020",
        "stars": 5
    }
]