[
    {
        "review_text": "Course description says \"Intermediate\", but the content provided is below beginner. Quiz questions are just there for the sake of being there since they have nothing to do with Kali.\n\nContent of the course is just basics of how Linux Command Line works. Course being called \"Kali Linux\" feels like a cheap scam to grab peoples attention since it covers nothing specific to Kali",
        "name": "By Kyvan E",
        "date": "Aug 1, 2024",
        "stars": 1
    },
    {
        "review_text": "I think the course should cover Kali Linux in more detail, but this course seems to only provide a general overview, making it feel more suited for beginners. If you're new to Kali Linux and want a basic understanding of its processes, this course is great for you. Otherwise, I wouldn't recommend attending the class.",
        "name": "By Ross",
        "date": "Aug 16, 2024",
        "stars": 2
    },
    {
        "review_text": "It is a best course ever. I have seen many courses but this is overlasting and complete course",
        "name": "By Mubarrim K",
        "date": "May 15, 2024",
        "stars": 5
    },
    {
        "review_text": "amazing and very useful course in growing one's career graph professional",
        "name": "By Harish R",
        "date": "Apr 13, 2024",
        "stars": 5
    },
    {
        "review_text": "i just learn the basics with many things good course 5 star rating",
        "name": "By Ahad Z",
        "date": "May 8, 2024",
        "stars": 5
    },
    {
        "review_text": "The course is a good one and can be recommend to others",
        "name": "By Aman K",
        "date": "Apr 17, 2024",
        "stars": 5
    },
    {
        "review_text": "Not an in depth course, but it will help you get started as a beginner.",
        "name": "By Joel M",
        "date": "Nov 14, 2024",
        "stars": 4
    },
    {
        "review_text": "Does not go deep enough into technical aspects. Non Kali Linux topics covered more than actual Kali Linux how-to. Questions on the quizzes are not covered in the videos. I did not get what I was looking for from this course.",
        "name": "By Marc K",
        "date": "Sep 10, 2024",
        "stars": 2
    },
    {
        "review_text": "I love this course because, well, first of all, i am interested in this topic, and most of all, i see the dedication made to this course from the author (maybe you,) and because your course was so open ended, not saying, \"hey this is all, just do whatever you can and scram\", but saying \"you can learn this and this, this is useful, you can try this...\". and once, again thank you so much for the great course! :)",
        "name": "By Jiazhen Y",
        "date": "Aug 10, 2024",
        "stars": 5
    },
    {
        "review_text": "Very interesting and fun. I'm learning through a hands-on approach to the basic details of how Kali Linux works and uses its tools. This course offered by Board Infinity will help me a lot on my journey to achieve my goal of working in the cybersecurity field.",
        "name": "By Jonás J",
        "date": "Apr 25, 2025",
        "stars": 5
    }
]