[
    {
        "review_text": "Good introduction course for those who just start studying a marine biology or for those who wants to expand their basic education in environmental sciences.",
        "name": "By Elena K",
        "date": "Sep 25, 2023",
        "stars": 5
    },
    {
        "review_text": "Content is good but way too much reading, I don't need a course for that, I can buy a book !\nAlso, 10 min for each reading is too short if you are not familiar with the topic, count at least 20 mins each time - which considerably adds to the actual training time",
        "name": "By Caroline K",
        "date": "Apr 29, 2024",
        "stars": 2
    },
    {
        "review_text": "The course is a wonderful introduction to marine biology! It's packed full of information and provides plenty of resources for further study. :)",
        "name": "By Nik N",
        "date": "Sep 28, 2023",
        "stars": 5
    },
    {
        "review_text": "A fascinating, sometimes beautiful, sometimes disturbing summary of ocean life, resources, and threats from pollution and overfishing.",
        "name": "By John D",
        "date": "Oct 15, 2023",
        "stars": 5
    },
    {
        "review_text": "The course content was comprehensive, well-structured, and engaging. The instructors skillfully covered a wide range of topics, including marine ecosystems, biodiversity, conservation, and the impact of human activities on the oceans. The lectures were informative, filled with fascinating facts and captivating visuals, which made it easy to stay engaged and absorb the wealth of knowledge being shared. The instructors' passion for marine biology was evident, and their enthusiasm was contagious, sparking a genuine interest and curiosity among the participants.",
        "name": "By Aakriti",
        "date": "Jun 25, 2023",
        "stars": 5
    },
    {
        "review_text": "This course is incredibly good. It gave me a lot of knowledge, allowed me to see marine biology in a way I had never seen it before. I was struck by the details about the study of bioluminescence and biofluorescence by mr. Sparks, the incredible data about larvaceans that Kakani Katija received. I especially love the awe with which Jeremy Goldbogen and David Cade study whales. And of course other scientists, they're all just amazing! I love this course, and anybody else, who's interested in marine biology gonna love it too.",
        "name": "By Луцив О А",
        "date": "Nov 20, 2023",
        "stars": 5
    },
    {
        "review_text": "It was a holistic and comprehensive course, that delved into some of the most fascinating concepts related to marine biology, along with the frontline problems faced by conservation biologists and others in quantifying the damage human beings have contributed to marine species and how exactly we can go about solving them. All in all, pretty holistic and detailed, and captivating enough to keep us interested. Enjoyed the course, my many thanks to the curators and scientists who contributed to the course.",
        "name": "By Mrudula R",
        "date": "Jul 18, 2024",
        "stars": 5
    },
    {
        "review_text": "I learned so much! Thank you for this course! I love that general principles are nicely described here, such as the chapter on water from a physical perspective, and at the same time there are plenty of specific studies, like the research on the shells of the Copelata group. The references for learning more about each chapter are also great. I really enjoyed learning new things about such a fantastic topic! If a continuation of the course comes out, I'll be on it right away!",
        "name": "By Vojtěch P",
        "date": "Sep 28, 2024",
        "stars": 5
    },
    {
        "review_text": "fell in love completely with this course from module 1 :) I gained so much knowledge about the world under waters and I really liked that the course also talked about how human & natural activities are threatening the marine life, as well as highlighting the conservation steps that have been taken to mitigate those threats. it really has been eye opening for me. i wish I could relive the experience of starting this course from the beginning again.",
        "name": "By mashira e",
        "date": "Jun 18, 2024",
        "stars": 5
    },
    {
        "review_text": "This course is very interesting and informative that has bring me to a broader understanding on life in the sea, its beautiful nature and the marine life existing through the videos. As a student, I am relieved to have this opportunity to get a glimpse of the marine world and to understand the basic need for urgent management for a sustaining marine environment for today and the future.",
        "name": "By Taekabu T",
        "date": "Aug 10, 2023",
        "stars": 5
    }
]