[
    {
        "review_text": "there were modules with \"upgrade to continue\".  either the course is free, or it isn't.  coursera isn't quantum mechanics.  it's not a superposition of \"free\", and \"not free\".  i don't mind paying for a class, but what i do mind is signing up for a class, going through the first two modules, then being told to \"upgrade to take/complete this assignment\"",
        "name": "By hamid m",
        "date": "Dec 25, 2024",
        "stars": 1
    },
    {
        "review_text": "Honestly not worth anybody's time. 90% is youtube videos and that's the best part of the course. I'd recommend just searching for basic quantum computing learning on youtube. The rest of the course is repetitive, one video is included twice lol, and extremely hard to understand due to ESL presenters.",
        "name": "By Matt t",
        "date": "Jan 10, 2025",
        "stars": 1
    },
    {
        "review_text": "The teaching method is very drab. It looks like the instructor is reading from a prompter or something. Also as the name suggests, Quantum computing for everyone should be taught in a more layman language. But it looks like since the instructor is reading from a prompter or something, he just gives sentences without trying to explain it in a more layman language like with some examples.",
        "name": "By Prakash K S",
        "date": "Dec 31, 2024",
        "stars": 1
    },
    {
        "review_text": "What a shameless money grab. They probably just stole the content and are reading it blandly without any interpretation. Take the IBM series. It is free and actual good, useful content.",
        "name": "By Jessie B",
        "date": "Feb 15, 2025",
        "stars": 1
    },
    {
        "review_text": "It was very tough for an introductory course. It can be made simpler for a novice to understand.",
        "name": "By Usha S",
        "date": "Feb 23, 2025",
        "stars": 4
    },
    {
        "review_text": "This course was a deep dive into the fascinating world of quantum mechanics, superposition, entanglement, and how quantum computers are poised to revolutionize the future of technology. From learning the fundamental principles to exploring the potential applications in cryptography, optimization, and beyond, it was an eye-opening experience.",
        "name": "By Rohith A",
        "date": "Sep 19, 2024",
        "stars": 5
    },
    {
        "review_text": "Great introduction and course! Wished it was longer and become a specialization.",
        "name": "By イザナギ風英仁",
        "date": "Sep 24, 2024",
        "stars": 5
    },
    {
        "review_text": "This was a good introduction to Quantum computing",
        "name": "By Betsy C",
        "date": "Mar 25, 2025",
        "stars": 5
    },
    {
        "review_text": "Super helpful introductory course",
        "name": "By Raphael V S",
        "date": "Aug 12, 2024",
        "stars": 5
    },
    {
        "review_text": "Must take course by everyone.",
        "name": "By Anthony W",
        "date": "May 12, 2025",
        "stars": 5
    }
]