[
    {
        "review_text": "I recently explored RNA Biology with Eterna, and I found it to be an intriguing experience. The game provides an interactive way to learn about RNA biology through puzzle-solving, which is both educational and engaging. The scientific accuracy of the content is commendable, as it introduces complex biological concepts in a way that's accessible to players of all levels.\nThe puzzles are challenging yet rewarding, and the integration of real-world scientific research into gameplay adds an extra layer of depth. However, I feel that some areas could use more guidance, especially for beginners who may not be familiar with molecular biology.\nOverall, I appreciate the innovative approach Eterna takes to educate players, and it’s a great resource for those interested in RNA biology. It could benefit from a bit more user-friendly tutorials, but it's a great way to engage with science in a fun and meaningful way.",
        "name": "By Aayush R D",
        "date": "Apr 1, 2025",
        "stars": 5
    },
    {
        "review_text": "Great for beginners, though some parts seem to be impossible to walk through without additional knowledge sources. Some Eterna puzzles are too complicated, and I gave up (pseudo knots, for instance), but it is a great way to understand 3D structure. Overall, I highly recommend this course for those who are interested in RNA mechanics.",
        "name": "By Artem R",
        "date": "Apr 26, 2025",
        "stars": 5
    },
    {
        "review_text": "a really nice course to start your learning habit, well drafted course with puzzles and tests, won't make you feel that your getting drained. nice 3d representation so that you can visualise thing easily. you will love it if you love biology.",
        "name": "By Shilpa p",
        "date": "Jan 20, 2024",
        "stars": 5
    },
    {
        "review_text": "This topic was studied at the university, but on the website it was more detailed and better explained. I liked everything was very clear. Thank you!",
        "name": "By Гулзат А",
        "date": "May 19, 2024",
        "stars": 5
    },
    {
        "review_text": "Very helpful to understand RNA biology based on the definition and relations of DNA, RNA, proteins, and ribosomes.",
        "name": "By Su J K",
        "date": "Feb 21, 2025",
        "stars": 5
    },
    {
        "review_text": "It was fascinating to learn new stuff of biology that I didn't know or understand, the course simplify everything",
        "name": "By Leonardo J A A",
        "date": "Feb 1, 2025",
        "stars": 5
    },
    {
        "review_text": "Es excelente. Lástima que en mi país no me sea por ahora posible pagar en moneda extranjera ☹️",
        "name": "By Indira d C P V",
        "date": "May 25, 2024",
        "stars": 5
    },
    {
        "review_text": "Me encanto el curso, todo muy bien explicado y los puzzles son muy divertidos y explicativos.",
        "name": "By Belén P V P",
        "date": "Mar 17, 2025",
        "stars": 5
    },
    {
        "review_text": "very much satisfied  with this course . game was very user friendly and very innovative.",
        "name": "By Shubhi U",
        "date": "Dec 11, 2024",
        "stars": 5
    },
    {
        "review_text": "very interesting course, great learning experience , enjoyed every thing about it",
        "name": "By mollina k",
        "date": "Aug 16, 2024",
        "stars": 5
    }
]